# Write a python program to display all the header tags from ‘en.wikipedia.org/wiki/Main_Page’.

In [1]:
from bs4 import BeautifulSoup
import requests

In [2]:
page = requests.get("https://en.wikipedia.org/wiki/Main_Page")
page

In [3]:
#page.content

In [4]:
target_wiki = BeautifulSoup(page.content)

In [5]:
#print(target_wiki.prettify())

In [6]:
headers = target_wiki.find_all(class_="mw-headline")
headers

[<span class="mw-headline" id="From_today's_featured_article">From today's featured article</span>,
 <span class="mw-headline" id="Did_you_know_...">Did you know ...</span>,
 <span class="mw-headline" id="In_the_news">In the news</span>,
 <span class="mw-headline" id="On_this_day">On this day</span>,
 <span class="mw-headline" id="Today's_featured_picture">Today's featured picture</span>,
 <span class="mw-headline" id="Other_areas_of_Wikipedia">Other areas of Wikipedia</span>,
 <span class="mw-headline" id="Wikipedia's_sister_projects">Wikipedia's sister projects</span>,
 <span class="mw-headline" id="Wikipedia_languages">Wikipedia languages</span>]

In [7]:
header = []
for i in headers:
    header.append(i.text.replace("",""))

In [8]:
header

["From today's featured article",
 'Did you know\xa0...',
 'In the news',
 'On this day',
 "Today's featured picture",
 'Other areas of Wikipedia',
 "Wikipedia's sister projects",
 'Wikipedia languages']

In [9]:
import pandas as pd
new_header = pd.DataFrame({})
new_header["Title"] = header

In [10]:
new_header

                           Title
0  From today's featured article
1               Did you know ...
2                    In the news
3                    On this day
4       Today's featured picture
5       Other areas of Wikipedia
6    Wikipedia's sister projects
7            Wikipedia languages

# Write a python program to display IMDB’s Top rated 100 movies’ data (i.e. Name, IMDB rating, Year of release).

In [11]:
page = requests.get("https://www.imdb.com/chart/top/?ref_=nv_mv_250")
page

In [12]:
#page.content

In [13]:
target_imdb = BeautifulSoup(page.content)

In [14]:
#print(target_imdb.prettify())

In [15]:
name_new = str(target_imdb.find('td',class_="titleColumn"))
name_new

'<td class="titleColumn">\n      1.\n      <a href="/title/tt0111161/" title="Frank Darabont (dir.), Tim Robbins, Morgan Freeman">The Shawshank Redemption</a>\n<span class="secondaryInfo">(1994)</span>\n</td>'

In [16]:
type(name_new)

str

In [17]:
name_new.split()

['<td',
 'class="titleColumn">',
 '1.',
 '<a',
 'href="/title/tt0111161/"',
 'title="Frank',
 'Darabont',
 '(dir.),',
 'Tim',
 'Robbins,',
 'Morgan',
 'Freeman">The',
 'Shawshank',
 'Redemption</a>',
 '<span',
 'class="secondaryInfo">(1994)</span>',
 '</td>']

In [18]:
name = target_imdb.find_all('td',class_="titleColumn")

In [19]:
#name

In [20]:
#extracting movies Name
movie_name = []
for i in name:
    movie_name.append(i.text.replace('\n',''))

In [21]:
#movie_name

In [22]:
len(movie_name)

250

In [23]:
final_movie_name = movie_name[0:100]
final_movie_name

['      1.      The Shawshank Redemption(1994)',
 '      2.      The Godfather(1972)',
 '      3.      The Godfather: Part II(1974)',
 '      4.      The Dark Knight(2008)',
 '      5.      12 Angry Men(1957)',
 "      6.      Schindler's List(1993)",
 '      7.      The Lord of the Rings: The Return of the King(2003)',
 '      8.      Pulp Fiction(1994)',
 '      9.      Il buono, il brutto, il cattivo(1966)',
 '      10.      The Lord of the Rings: The Fellowship of the Ring(2001)',
 '      11.      Fight Club(1999)',
 '      12.      Forrest Gump(1994)',
 '      13.      Inception(2010)',
 '      14.      The Lord of the Rings: The Two Towers(2002)',
 '      15.      Star Wars: Episode V - The Empire Strikes Back(1980)',
 '      16.      The Matrix(1999)',
 '      17.      Goodfellas(1990)',
 "      18.      One Flew Over the Cuckoo's Nest(1975)",
 '      19.      Shichinin no samurai(1954)',
 '      20.      Se7en(1995)',
 '      21.      The Silence of the Lambs(1991)',
 '      22.      Cidade de Deus(2002)',
 '      23.      La vita è bella(1997)',
 "      24.      It's a Wonderful Life(1946)",
 '      25.      Star Wars(1977)',
 '      26.      Saving Private Ryan(1998)',
 '      27.      Interstellar(2014)',
 '      28.      Sen to Chihiro no kamikakushi(2001)',
 '      29.      The Green Mile(1999)',
 '      30.      Gisaengchung(2019)',
 '      31.      Léon(1994)',
 '      32.      Seppuku(1962)',
 '      33.      The Pianist(2002)',
 '      34.      The Usual Suspects(1995)',
 '      35.      Terminator 2: Judgment Day(1991)',
 '      36.      Back to the Future(1985)',
 '      37.      Psycho(1960)',
 '      38.      The Lion King(1994)',
 '      39.      Modern Times(1936)',
 '      40.      American History X(1998)',
 '      41.      City Lights(1931)',
 '      42.      Hotaru no haka(1988)',
 '      43.      Whiplash(2014)',
 '      44.      Gladiator(2000)',
 '      45.      The Departed(2006)',
 '      46.      The Intouchables(2011)',
 '      47.      The Prestige(2006)',
 '      48.      Casablanca(1942)',
 '      49.      Once Upon a Time in the West(1968)',
 '      50.      Rear Window(1954)',
 '      51.      Nuovo Cinema Paradiso(1988)',
 '      52.      Alien(1979)',
 '      53.      Apocalypse Now(1979)',
 '      54.      Memento(2000)',
 '      55.      Raiders of the Lost Ark(1981)',
 '      56.      The Great Dictator(1940)',
 '      57.      The Lives of Others(2006)',
 '      58.      Django Unchained(2012)',
 '      59.      Paths of Glory(1957)',
 '      60.      Sunset Blvd.(1950)',
 '      61.      WALL·E(2008)',
 '      62.      Avengers: Infinity War(2018)',
 '      63.      The Shining(1980)',
 '      64.      Witness for the Prosecution(1957)',
 '      65.      Spider-Man: Into the Spider-Verse(2018)',
 '      66.      Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb(1964)',
 '      67.      Joker(2019)',
 '      68.      Mononoke-hime(1997)',
 '      69.      Oldeuboi(2003)',
 '      70.      Kimi no na wa.(2016)',
 '      71.      The Dark Knight Rises(2012)',
 '      72.      Once Upon a Time in America(1984)',
 '      73.      Coco(2017)',
 '      74.      Aliens(1986)',
 '      75.      Capharnaüm(2018)',
 '      76.      Avengers: Endgame(2019)',
 '      77.      Das Boot(1981)',
 '      78.      Hamilton(2020)',
 '      79.      Tengoku to jigoku(1963)',
 '      80.      American Beauty(1999)',
 '      81.      Toy Story(1995)',
 '      82.      3 Idiots(2009)',
 '      83.      Amadeus(1984)',
 '      84.      Braveheart(1995)',
 '      85.      Inglourious Basterds(2009)',
 '      86.      Good Will Hunting(1997)',
 '      87.      Star Wars: Episode VI - Return of the Jedi(1983)',
 '      88.      2001: A Space Odyssey(1968)',
 '      89.      Reservoir Dogs(1992)',
 '      90.      M - Eine Stadt sucht einen Mörder(1931)',
 '      91.      Taare Zameen Par(2007)',
 '      92.      Vertigo(1958)',
 '      93.      Citizen Kane(1941)',
 '      94.      Idi i smotri(1985)',
 '      95.      Jagten(2012)',
 '      96.      Requiem for a Dream(2000)',
 "      97.      Singin' in the Rain(1952)",
 '      98.      North by Northwest(1959)',
 '      99.      Eternal Sunshine of the Spotless Mind(2004)',
 '      100.      Ladri di biciclette(1948)']

IMDB rating

In [24]:
name = target_imdb.find_all('td',class_="ratingColumn imdbRating")

In [25]:
#name

In [26]:
rating = []
for i in name:
    rating.append(i.text.replace('\n',''))

In [27]:
#rating

In [28]:
final_rating = rating[0:100]
#final_rating

In [29]:
len(final_rating)

100

Year of release

In [30]:
year = target_imdb.find_all('span',class_="secondaryInfo")
#year

In [31]:
#extracting movies Year
movie_year = []
for i in year:
    movie_year.append(i.text.replace('\n',''))

In [32]:
#movie_year

In [33]:
len(movie_year)

250

In [34]:
final_movie_year = movie_year[0:100]
#final_movie_year

In [35]:
print(len(final_movie_year),len(final_rating),len(final_movie_name))

100 100 100

In [36]:
imdb_rating = pd.DataFrame({})
imdb_rating['Movie Name'] = final_movie_name
imdb_rating['Year Of Release'] = final_movie_year
imdb_rating['IMDB Ratings'] = final_rating

In [37]:
imdb_rating.head(10)

,Movie Name,Year Of Release,IMDB Ratings
0,1. The Shawshank Redemption(1994),(1994),9.2
1,2. The Godfather(1972),(1972),9.1
2,3. The Godfather: Part II(1974),(1974),9.0
3,4. The Dark Knight(2008),(2008),9.0
4,5. 12 Angry Men(1957),(1957),8.9
5,6. Schindler's List(1993),(1993),8.9
6,7. The Lord of the Rings: The Retur...,(2003),8.9
7,8. Pulp Fiction(1994),(1994),8.8
8,"9. Il buono, il brutto, il cattivo(...",(1966),8.8
9,10. The Lord of the Rings: The Fell...,(2001),8.8

# Write a python program to scrap book name, author name, genre and book review of any 5 books from ‘www.bookpage.com’

#List of books

#A Calling for Charlie Barnes : https://bookpage.com/reviews/26658-joshua-ferris-calling-charlie-barnes-fiction#.YVTCp7gzZPY

#Playing the Cards You’re Dealt : https://bookpage.com/reviews/26703-varian-johnson-playing-cards-youre-dealt-childrens#.YVTCpLgzZPY

#Horseman : https://bookpage.com/reviews/26686-christina-henry-horseman-science-fiction-fantasy#.YVTCn7gzZPY

#Cloud Cuckoo Land : https://bookpage.com/reviews/26660-anthony-doerr-cloud-cuckoo-land-fiction#.YVTCnLgzZPY

#From the Tops of the Trees : https://bookpage.com/reviews/26676-kao-kalia-yang-from-tops-trees-childrens#.YVTClrgzZPY

In [38]:
page1 = requests.get('https://bookpage.com/reviews/26658-joshua-ferris-calling-charlie-barnes-fiction#.YVTCp7gzZPY')
print(page1)
page2 = requests.get('https://bookpage.com/reviews/26703-varian-johnson-playing-cards-youre-dealt-childrens#.YVTCpLgzZPY')
print(page2)
page3 = requests.get('https://bookpage.com/reviews/26686-christina-henry-horseman-science-fiction-fantasy#.YVTCn7gzZPY')
print(page3)
page4 = requests.get('https://bookpage.com/reviews/26660-anthony-doerr-cloud-cuckoo-land-fiction#.YVTCnLgzZPY')
print(page4)
page5 = requests.get('https://bookpage.com/reviews/26676-kao-kalia-yang-from-tops-trees-childrens#.YVTClrgzZPY')
print(page5)

<Response [200]>
<Response [200]>
<Response [200]>
<Response [200]>
<Response [200]>

In [39]:
target1 = BeautifulSoup(page1.content)
target2 = BeautifulSoup(page2.content)
target3 = BeautifulSoup(page3.content)
target4 = BeautifulSoup(page4.content)
target5 = BeautifulSoup(page5.content)

In [40]:
target = [target1,target2,target3,target4,target5]
book_na = []
for i in range(0,5):
    book_na.append(target[i].find(class_="italic").text.strip())

In [41]:
book_name = book_na[0:5]
book_name

['★ A Calling for Charlie Barnes',
 "Playing the Cards You're Dealt",
 'Horseman',
 '★ Cloud Cuckoo Land',
 'From the Tops of the Trees']

In [42]:
auth_name = []
for i in range(0,5):
    auth_name.append(target[i].find('h4',class_="sans").text.strip())

In [43]:
auth_name

['Joshua Ferris',
 'Varian Johnson',
 'Christina Henry',
 'Anthony Doerr',
 'Kao Kalia Yang, Rachel Wada']

In [44]:
genre = []
for i in range(0,5):
    genre.append(target[i].find('p',class_="genre-links").text.replace('\n',""))

In [45]:
genre

['Fiction / Family Drama',
 "Children's / Middle Grade",
 'Science Fiction & Fantasy / Fantasy / Historical Fantasy',
 'Fiction / Literary Fiction',
 "Children's / Picture Book"]

In [46]:
reveiw = []
for i in range(0,5):
    reveiw.append(target[i].find('div',class_="article-body").text)

In [47]:
import pandas as pd
book_reveiw = pd.DataFrame({})
book_reveiw['Book Name'] = book_name
book_reveiw['Author Name'] = auth_name
book_reveiw["Book Genre"] = genre
book_reveiw["Book Review"] = reveiw

book_reveiw

,Book Name,Author Name,Book Genre,Book Review
0,★ A Calling for Charlie Barnes,Joshua Ferris,Fiction / Family Drama,\n\nHow does one sum up the arc of a long life...
1,Playing the Cards You're Dealt,Varian Johnson,Children's / Middle Grade,"\n\nIt’s day one of fifth grade, and Anthony “..."
2,Horseman,Christina Henry,Science Fiction & Fantasy / Fantasy / Historic...,\n\nChristina Henry’s Horseman is an atmospher...
3,★ Cloud Cuckoo Land,Anthony Doerr,Fiction / Literary Fiction,\n\nFans of Anthony Doerr’s Pulitzer Prize-win...
4,From the Tops of the Trees,"Kao Kalia Yang, Rachel Wada",Children's / Picture Book,\n\nWith realism and a strong thread of empowe...

# Write a python program to scrape cricket rankings from ‘www.icc-cricket.com’. You have to scrape: i) Top 10 ODI teams in men’s cricket along with the records for matches, points and rating. ii) Top 10 ODI Batsmen in men along with the records of their team and rating. iii) Top 10 ODI bowlers along with the records of their team and rating.

In [48]:
page = requests.get("https://www.icc-cricket.com/rankings/mens/team-rankings/odi")
page

In [49]:
target_cricket = BeautifulSoup(page.content)

In [50]:
title_first = target_cricket.find_all('span',class_='u-hide-phablet')

In [51]:
team = []
for i in title_first:
    team.append(i.text)

In [52]:
team_name = team[0:10]
team_name

['New Zealand',
 'England',
 'Australia',
 'India',
 'South Africa',
 'Pakistan',
 'Bangladesh',
 'West Indies',
 'Sri Lanka',
 'Afghanistan']

In [53]:
len(team_name)

10

In [54]:
match1 = target_cricket.find('td',class_='rankings-block__banner--matches')
points1 = target_cricket.find('td',class_='rankings-block__banner--points')
rating1 = target_cricket.find('td',class_="rankings-block__banner--rating u-text-right".strip())

In [55]:
print(match1.text)
print(points1.text)
print(rating1.text)

17
2,054

                            121

In [56]:
match = target_cricket.find_all('td',class_='table-body__cell u-center-text')
match[0:18]

[<td class="table-body__cell u-center-text">32</td>,
 <td class="table-body__cell u-center-text">3,793</td>,
 <td class="table-body__cell u-center-text">28</td>,
 <td class="table-body__cell u-center-text">3,244</td>,
 <td class="table-body__cell u-center-text">32</td>,
 <td class="table-body__cell u-center-text">3,624</td>,
 <td class="table-body__cell u-center-text">25</td>,
 <td class="table-body__cell u-center-text">2,459</td>,
 <td class="table-body__cell u-center-text">27</td>,
 <td class="table-body__cell u-center-text">2,524</td>,
 <td class="table-body__cell u-center-text">30</td>,
 <td class="table-body__cell u-center-text">2,740</td>,
 <td class="table-body__cell u-center-text">30</td>,
 <td class="table-body__cell u-center-text">2,523</td>,
 <td class="table-body__cell u-center-text">32</td>,
 <td class="table-body__cell u-center-text">2,657</td>,
 <td class="table-body__cell u-center-text">17</td>,
 <td class="table-body__cell u-center-text">1,054</td>]

In [57]:
len(match)

38

In [58]:
matches = match[0:18:2]
matches

[<td class="table-body__cell u-center-text">32</td>,
 <td class="table-body__cell u-center-text">28</td>,
 <td class="table-body__cell u-center-text">32</td>,
 <td class="table-body__cell u-center-text">25</td>,
 <td class="table-body__cell u-center-text">27</td>,
 <td class="table-body__cell u-center-text">30</td>,
 <td class="table-body__cell u-center-text">30</td>,
 <td class="table-body__cell u-center-text">32</td>,
 <td class="table-body__cell u-center-text">17</td>]

In [59]:
points = match[1:18:2]
points

[<td class="table-body__cell u-center-text">3,793</td>,
 <td class="table-body__cell u-center-text">3,244</td>,
 <td class="table-body__cell u-center-text">3,624</td>,
 <td class="table-body__cell u-center-text">2,459</td>,
 <td class="table-body__cell u-center-text">2,524</td>,
 <td class="table-body__cell u-center-text">2,740</td>,
 <td class="table-body__cell u-center-text">2,523</td>,
 <td class="table-body__cell u-center-text">2,657</td>,
 <td class="table-body__cell u-center-text">1,054</td>]

In [60]:
rate = target_cricket.find_all('td',class_='table-body__cell u-text-right rating')
rate

[<td class="table-body__cell u-text-right rating">119</td>,
 <td class="table-body__cell u-text-right rating">116</td>,
 <td class="table-body__cell u-text-right rating">113</td>,
 <td class="table-body__cell u-text-right rating">98</td>,
 <td class="table-body__cell u-text-right rating">93</td>,
 <td class="table-body__cell u-text-right rating">91</td>,
 <td class="table-body__cell u-text-right rating">84</td>,
 <td class="table-body__cell u-text-right rating">83</td>,
 <td class="table-body__cell u-text-right rating">62</td>,
 <td class="table-body__cell u-text-right rating">48</td>,
 <td class="table-body__cell u-text-right rating">46</td>,
 <td class="table-body__cell u-text-right rating">40</td>,
 <td class="table-body__cell u-text-right rating">39</td>,
 <td class="table-body__cell u-text-right rating">38</td>,
 <td class="table-body__cell u-text-right rating">30</td>,
 <td class="table-body__cell u-text-right rating">21</td>,
 <td class="table-body__cell u-text-right rating">17</td>,
 <td class="table-body__cell u-text-right rating">16</td>,
 <td class="table-body__cell u-text-right rating">0</td>]

In [61]:
rating = rate[0:9]
rating

[<td class="table-body__cell u-text-right rating">119</td>,
 <td class="table-body__cell u-text-right rating">116</td>,
 <td class="table-body__cell u-text-right rating">113</td>,
 <td class="table-body__cell u-text-right rating">98</td>,
 <td class="table-body__cell u-text-right rating">93</td>,
 <td class="table-body__cell u-text-right rating">91</td>,
 <td class="table-body__cell u-text-right rating">84</td>,
 <td class="table-body__cell u-text-right rating">83</td>,
 <td class="table-body__cell u-text-right rating">62</td>]

In [62]:
print(len(team_name),len(matches),len(points),len(rating))

10 9 9 9

In [63]:
matches.insert(0,match1)
points.insert(0,points1)
rating.insert(0,rating1)

In [64]:
print(len(team_name),len(matches),len(points),len(rating))

10 10 10 10

In [65]:
import pandas as pd
top_10_teams = pd.DataFrame({})
top_10_teams['Teams'] = team_name
top_10_teams['Matches Played'] = matches
top_10_teams['Points'] = points
top_10_teams['Ratings'] = rating

top_10_teams

,Teams,Matches Played,Points,Ratings
0,New Zealand,[17],"[2,054]",[\n 121\n ...
1,England,[32],"[3,793]",[119]
2,Australia,[28],"[3,244]",[116]
3,India,[32],"[3,624]",[113]
4,South Africa,[25],"[2,459]",[98]
5,Pakistan,[27],"[2,524]",[93]
6,Bangladesh,[30],"[2,740]",[91]
7,West Indies,[30],"[2,523]",[84]
8,Sri Lanka,[32],"[2,657]",[83]
9,Afghanistan,[17],"[1,054]",[62]

In [66]:
batsmen = requests.get('https://www.icc-cricket.com/rankings/mens/player-rankings/odi/batting')
batsmen

In [67]:
target_batsmen = BeautifulSoup(batsmen.content)

In [68]:
title1 = target_batsmen.find(class_='rankings-block__banner--name-large').text
title1

'Babar Azam'

In [69]:
rank1 = target_batsmen.find(class_='rankings-block__position').text
rank1

'1'

In [70]:
rate1 = target_batsmen.find(class_='rankings-block__banner--rating').text
rate1

'873'

In [71]:
team1 = target_batsmen.find(class_='rankings-block__banner--nationality').text.strip()
team1

'PAK'

In [72]:
title2 = target_batsmen.find_all(class_= 'table-body__cell rankings-table__name name')

In [73]:
title = []
for i in title2:
    title.append(i.text.replace("\n",""))

In [74]:
player_name = title[0:9]
print(player_name)
print("length is",len(player_name))

['Virat Kohli', 'Rohit Sharma', 'Ross Taylor', 'Aaron Finch', 'Jonny Bairstow', 'David Warner', 'Shai Hope', 'Kane Williamson', 'Quinton de Kock']
length is 9

In [75]:
rank2 = target_batsmen.find_all(class_='table-body__cell table-body__cell--position u-text-right')

In [76]:
pos = []
for i in rank2:
    pos.append(i.text.strip())

In [77]:
position = pos[0:9]
print(position)
print("length is",len(position))

['2', '3', '4', '5', '6', '7', '8', '9', '10']
length is 9

In [78]:
rate2 = target_batsmen.find_all(class_='table-body__cell rating')

In [79]:
rat = []
for i in rate2:
    rat.append(i.text)

In [80]:
ratings = rat[0:9]
print(ratings)
print("Length is",len(ratings))

['844', '813', '801', '779', '775', '762', '758', '754', '747']
Length is 9

In [81]:
team2 = target_batsmen.find_all(class_='table-body__logo-text')

In [82]:
team3 = []
for i in team2:
    team3.append(i.text)

In [83]:
team = team3[0:9]
print(team)
print('length of team is',len(team))

['IND', 'IND', 'NZ', 'AUS', 'ENG', 'AUS', 'WI', 'NZ', 'SA']
length of team is 9

In [84]:
print(len(player_name),len(position),len(ratings),len(team))

9 9 9 9

In [85]:
player_name.insert(0,title1)
position.insert(0,rank1)
ratings.insert(0,rate1)
team.insert(0,team1)

In [86]:
print(len(player_name),len(position),len(ratings),len(team))

10 10 10 10

In [87]:
batsmen_details = pd.DataFrame({})
batsmen_details['Player Name'] = player_name
batsmen_details['Position of Player'] = position
batsmen_details['Team'] = team
batsmen_details['Overall Ratings'] = ratings

batsmen_details

       Player Name Position of Player Team Overall Ratings
0       Babar Azam                  1  PAK             873
1      Virat Kohli                  2  IND             844
2     Rohit Sharma                  3  IND             813
3      Ross Taylor                  4   NZ             801
4      Aaron Finch                  5  AUS             779
5   Jonny Bairstow                  6  ENG             775
6     David Warner                  7  AUS             762
7        Shai Hope                  8   WI             758
8  Kane Williamson                  9   NZ             754
9  Quinton de Kock                 10   SA             747

In [88]:
bowling = requests.get('https://www.icc-cricket.com/rankings/mens/player-rankings/odi/bowling')
bowling

In [89]:
target_bowler = BeautifulSoup(bowling.content)

In [90]:
head1 = target_bowler.find(class_ = 'rankings-block__position').text
head1

'1'

In [91]:
name1 = target_bowler.find(class_='rankings-block__banner--name-large').text
name1

'Trent Boult'

In [92]:
rat1 = target_bowler.find(class_='rankings-block__banner--rating').text
rat1

'737'

In [93]:
team1 = target_bowler.find(class_='rankings-block__banner--nationality').text.strip()
team1

'NZ'

In [94]:
head2 = target_bowler.find_all(class_='table-body__cell table-body__cell--position u-text-right')

In [95]:
pos2 = []
for i in head2:
    pos2.append(i.text.strip())

In [96]:
positions = pos[0:9]
print(positions)
print(len(positions))

['2', '3', '4', '5', '6', '7', '8', '9', '10']
9

In [97]:
name2 = target_bowler.find_all(class_='table-body__cell rankings-table__name name')

nam = []
for i in name2:
    nam.append(i.text.replace('\n',""))

In [98]:
names = nam[0:9]
names

['Josh Hazlewood',
 'Mujeeb Ur Rahman',
 'Chris Woakes',
 'Mehedi Hasan',
 'Matt Henry',
 'Jasprit Bumrah',
 'Mitchell Starc',
 'Shakib Al Hasan',
 'Kagiso Rabada']

In [99]:
rat2 = target_bowler.find_all(class_='table-body__cell rating')

rati = []
for i in rat2:
    rati.append(i.text)

In [100]:
ratings = rati[0:9]
ratings

['709', '708', '700', '692', '691', '679', '652', '650', '646']

In [101]:
team2 = target_bowler.find_all(class_="table-body__logo-text")

In [102]:
team4 = []
for i in team2:
    team4.append(i.text)

In [103]:
team = team4[0:9]
print(team)
print(len(team))

['AUS', 'AFG', 'ENG', 'BAN', 'NZ', 'IND', 'AUS', 'BAN', 'SA']
9

In [104]:
positions.insert(0,head1)
names.insert(0,name1)
ratings.insert(0,rat1)
team.insert(0,team1)

In [105]:
print(len(positions),len(names),len(ratings),len(team))

10 10 10 10

In [106]:
bowler_ratings = pd.DataFrame({})
bowler_ratings['Name'] = names
bowler_ratings['Positions'] = positions
bowler_ratings['Team'] = team
bowler_ratings['Ratings'] = ratings

bowler_ratings

               Name Positions Team Ratings
0       Trent Boult         1   NZ     737
1    Josh Hazlewood         2  AUS     709
2  Mujeeb Ur Rahman         3  AFG     708
3      Chris Woakes         4  ENG     700
4      Mehedi Hasan         5  BAN     692
5        Matt Henry         6   NZ     691
6    Jasprit Bumrah         7  IND     679
7    Mitchell Starc         8  AUS     652
8   Shakib Al Hasan         9  BAN     650
9     Kagiso Rabada        10   SA     646

# Write a python program to scrape house details from https://www.nobroker.in/ for any location. It should include house title, location, area, emi and price

In [107]:
page = requests.get('https://www.nobroker.in/property/sale/delhi/Rohini?searchParam=W3sibGF0IjoyOC43MzgyNjc2OTk5OTk5OSwibG9uIjo3Ny4wODIyMTUxLCJwbGFjZUlkIjoiQ2hJSlBZQ2hSem9CRFRrUkwxNkJkOFNNLS0wIiwicGxhY2VOYW1lIjoiUm9oaW5pIn1d&radius=2.0')
page

In [108]:
target_house = BeautifulSoup(page.content)

In [109]:
title = target_house.find_all(class_='heading-6 font-semi-bold nb__1AShY')
title

[<h2 class="heading-6 font-semi-bold nb__1AShY"><span itemprop="name">1 BHK Flat  For Sale  In Dda Flat In Rohini</span> <svg aria-hidden="true" class="jss1" focusable="false" role="presentation" viewbox="0 0 24 24"><path d="M0 0h24v24H0z" fill="none"></path><path d="M19 19H5V5h7V3H5c-1.11 0-2 .9-2 2v14c0 1.1.89 2 2 2h14c1.1 0 2-.9 2-2v-7h-2v7zM14 3v2h3.59l-9.83 9.83 1.41 1.41L19 6.41V10h2V3h-7z"></path></svg></h2>,
 <h2 class="heading-6 font-semi-bold nb__1AShY"><span itemprop="name">2 BHK Flat  For Sale  In Independent Builder Floor In Rohini</span> <svg aria-hidden="true" class="jss1" focusable="false" role="presentation" viewbox="0 0 24 24"><path d="M0 0h24v24H0z" fill="none"></path><path d="M19 19H5V5h7V3H5c-1.11 0-2 .9-2 2v14c0 1.1.89 2 2 2h14c1.1 0 2-.9 2-2v-7h-2v7zM14 3v2h3.59l-9.83 9.83 1.41 1.41L19 6.41V10h2V3h-7z"></path></svg></h2>,
 <h2 class="heading-6 font-semi-bold nb__1AShY"><span itemprop="name">2 BHK Flat  For Sale  In Builder Floor In Rohini</span> <svg aria-hidden="true" class="jss1" focusable="false" role="presentation" viewbox="0 0 24 24"><path d="M0 0h24v24H0z" fill="none"></path><path d="M19 19H5V5h7V3H5c-1.11 0-2 .9-2 2v14c0 1.1.89 2 2 2h14c1.1 0 2-.9 2-2v-7h-2v7zM14 3v2h3.59l-9.83 9.83 1.41 1.41L19 6.41V10h2V3h-7z"></path></svg></h2>,
 <h2 class="heading-6 font-semi-bold nb__1AShY"><span itemprop="name">3 BHK Flat  For Sale  In Rohini Sector 21</span> <svg aria-hidden="true" class="jss1" focusable="false" role="presentation" viewbox="0 0 24 24"><path d="M0 0h24v24H0z" fill="none"></path><path d="M19 19H5V5h7V3H5c-1.11 0-2 .9-2 2v14c0 1.1.89 2 2 2h14c1.1 0 2-.9 2-2v-7h-2v7zM14 3v2h3.59l-9.83 9.83 1.41 1.41L19 6.41V10h2V3h-7z"></path></svg></h2>,
 <h2 class="heading-6 font-semi-bold nb__1AShY"><span itemprop="name">2 BHK Flat  For Sale  In Westend Apartment Rohini In Rohini</span> <svg aria-hidden="true" class="jss1" focusable="false" role="presentation" viewbox="0 0 24 24"><path d="M0 0h24v24H0z" fill="none"></path><path d="M19 19H5V5h7V3H5c-1.11 0-2 .9-2 2v14c0 1.1.89 2 2 2h14c1.1 0 2-.9 2-2v-7h-2v7zM14 3v2h3.59l-9.83 9.83 1.41 1.41L19 6.41V10h2V3h-7z"></path></svg></h2>,
 <h2 class="heading-6 font-semi-bold nb__1AShY"><span itemprop="name">1 BHK Flat  For Sale  In Dda Lig Flats In Rohini</span> <svg aria-hidden="true" class="jss1" focusable="false" role="presentation" viewbox="0 0 24 24"><path d="M0 0h24v24H0z" fill="none"></path><path d="M19 19H5V5h7V3H5c-1.11 0-2 .9-2 2v14c0 1.1.89 2 2 2h14c1.1 0 2-.9 2-2v-7h-2v7zM14 3v2h3.59l-9.83 9.83 1.41 1.41L19 6.41V10h2V3h-7z"></path></svg></h2>,
 <h2 class="heading-6 font-semi-bold nb__1AShY"><span itemprop="name">2 BHK In Independent House  For Sale  In Rohini, Delhi, India</span> <svg aria-hidden="true" class="jss1" focusable="false" role="presentation" viewbox="0 0 24 24"><path d="M0 0h24v24H0z" fill="none"></path><path d="M19 19H5V5h7V3H5c-1.11 0-2 .9-2 2v14c0 1.1.89 2 2 2h14c1.1 0 2-.9 2-2v-7h-2v7zM14 3v2h3.59l-9.83 9.83 1.41 1.41L19 6.41V10h2V3h-7z"></path></svg></h2>,
 <h2 class="heading-6 font-semi-bold nb__1AShY"><span itemprop="name">2 BHK In Independent House  For Sale  In Rohini</span> <svg aria-hidden="true" class="jss1" focusable="false" role="presentation" viewbox="0 0 24 24"><path d="M0 0h24v24H0z" fill="none"></path><path d="M19 19H5V5h7V3H5c-1.11 0-2 .9-2 2v14c0 1.1.89 2 2 2h14c1.1 0 2-.9 2-2v-7h-2v7zM14 3v2h3.59l-9.83 9.83 1.41 1.41L19 6.41V10h2V3h-7z"></path></svg></h2>,
 <h2 class="heading-6 font-semi-bold nb__1AShY"><span itemprop="name">1 RK Flat  For Sale  In Rohini</span> <svg aria-hidden="true" class="jss1" focusable="false" role="presentation" viewbox="0 0 24 24"><path d="M0 0h24v24H0z" fill="none"></path><path d="M19 19H5V5h7V3H5c-1.11 0-2 .9-2 2v14c0 1.1.89 2 2 2h14c1.1 0 2-.9 2-2v-7h-2v7zM14 3v2h3.59l-9.83 9.83 1.41 1.41L19 6.41V10h2V3h-7z"></path></svg></h2>,
 <h2 class="heading-6 font-semi-bold nb__1AShY"><span itemprop="name">2 BHK Flat  For Sale  In Sector 2 Rohini ,dda Lig Flats Pocket 5 In Rohini</span> <svg aria-hidden="true" class="jss1" focusable="false" role="presentation" viewbox="0 0 24 24"><path d="M0 0h24v24H0z" fill="none"></path><path d="M19 19H5V5h7V3H5c-1.11 0-2 .9-2 2v14c0 1.1.89 2 2 2h14c1.1 0 2-.9 2-2v-7h-2v7zM14 3v2h3.59l-9.83 9.83 1.41 1.41L19 6.41V10h2V3h-7z"></path></svg></h2>]

In [110]:
house_title = []
for i in title:
    house_title.append(i.text)

house_title

['1 BHK Flat  For Sale  In Dda Flat In Rohini ',
 '2 BHK Flat  For Sale  In Independent Builder Floor In Rohini ',
 '2 BHK Flat  For Sale  In Builder Floor In Rohini ',
 '3 BHK Flat  For Sale  In Rohini Sector 21 ',
 '2 BHK Flat  For Sale  In Westend Apartment Rohini In Rohini ',
 '1 BHK Flat  For Sale  In Dda Lig Flats In Rohini ',
 '2 BHK In Independent House  For Sale  In Rohini, Delhi, India ',
 '2 BHK In Independent House  For Sale  In Rohini ',
 '1 RK Flat  For Sale  In Rohini ',
 '2 BHK Flat  For Sale  In Sector 2 Rohini ,dda Lig Flats Pocket 5 In Rohini ']

In [111]:
print("Length of House Title is",len(house_title))

Length of House Title is 10

In [112]:
loc = target_house.find_all(class_='nb__2CMjv')
loc

[<div class="nb__2CMjv">Rituals metro station</div>,
 <div class="nb__2CMjv">sector 22 rohini</div>,
 <div class="nb__2CMjv">125, I-4, sector 16, Rohini</div>,
 <div class="nb__2CMjv">Standalone building, Pocket 7,Near New Millennium Apartments, Pocket-7 </div>,
 <div class="nb__2CMjv">Rohini</div>,
 <div class="nb__2CMjv">Utsav Marg, near NIDM</div>,
 <div class="nb__2CMjv">Location,  H no.  B-19/295, kailash vihar pansali,  Rohini,  New Delhi,  110042.</div>,
 <div class="nb__2CMjv">sector 24</div>,
 <div class="nb__2CMjv">D/17,sector 3</div>,
 <div class="nb__2CMjv">pocket 5 sector 2 rohini</div>]

In [113]:
location = []
for i in loc:
    location.append(i.text)
    
location

['Rituals metro station',
 'sector 22 rohini',
 '125, I-4, sector 16, Rohini',
 'Standalone building, Pocket 7,Near New Millennium Apartments, Pocket-7 ',
 'Rohini',
 'Utsav Marg, near NIDM',
 'Location,  H no.  B-19/295, kailash vihar pansali,  Rohini,  New Delhi,  110042.',
 'sector 24',
 'D/17,sector 3',
 'pocket 5 sector 2 rohini']

In [114]:
print('The length of location is',len(location))

The length of location is 10

In [115]:
area = target_house.find_all(class_="nb__3oNyC")
area

[<div class="nb__3oNyC">400 sqft</div>,
 <div class="nb__3oNyC">517 sqft</div>,
 <div class="nb__3oNyC">630 sqft</div>,
 <div class="nb__3oNyC">516 sqft</div>,
 <div class="nb__3oNyC">1,200 sqft</div>,
 <div class="nb__3oNyC">500 sqft</div>,
 <div class="nb__3oNyC">540 sqft</div>,
 <div class="nb__3oNyC">784 sqft</div>,
 <div class="nb__3oNyC">280 sqft</div>,
 <div class="nb__3oNyC">500 sqft</div>]

In [116]:
house_area = []
for i in area:
    house_area.append(i.text)
    
house_area

['400 sqft',
 '517 sqft',
 '630 sqft',
 '516 sqft',
 '1,200 sqft',
 '500 sqft',
 '540 sqft',
 '784 sqft',
 '280 sqft',
 '500 sqft']

In [117]:
emi = target_house.find_all(class_="font-semi-bold heading-6")

In [118]:
final_emi = []
for i in emi:
    final_emi.append(i.text)

In [119]:
prices = final_emi[2:30:3]
prices

['₹25 Lacs',
 '₹36 Lacs',
 '₹55 Lacs',
 '₹32 Lacs',
 '₹95 Lacs',
 '₹30 Lacs',
 '₹21 Lacs',
 '₹80 Lacs',
 '₹21 Lacs',
 '₹42 Lacs']

In [120]:
area = final_emi[0:30:3]
area

['400 sqft',
 '517 sqft',
 '630 sqft',
 '516 sqft',
 '1,200 sqft',
 '500 sqft',
 '540 sqft',
 '784 sqft',
 '280 sqft',
 '500 sqft']

In [121]:
all_emi = final_emi[1:30:3]
all_emi

['₹14,328/Month',
 '₹20,633/Month',
 '₹31,522/Month',
 '₹18,340/Month',
 '₹54,448/Month',
 '₹17,194/Month',
 '₹12,036/Month',
 '₹45,851/Month',
 '₹12,036/Month',
 '₹24,072/Month']

In [122]:
print('The length of Emi is',len(final_emi))
print('The length of Emi is',len(all_emi))

The length of Emi is 30
The length of Emi is 10

In [123]:
house_list = pd.DataFrame({})
house_list['House Title'] = house_title
house_list['Location'] = location
house_list['Price of House'] = prices
house_list['EMI'] = all_emi
house_list['Area'] = area

house_list

,House Title,Location,Price of House,EMI,Area
0,1 BHK Flat For Sale In Dda Flat In Rohini,Rituals metro station,₹25 Lacs,"₹14,328/Month",400 sqft
1,2 BHK Flat For Sale In Independent Builder F...,sector 22 rohini,₹36 Lacs,"₹20,633/Month",517 sqft
2,2 BHK Flat For Sale In Builder Floor In Rohini,"125, I-4, sector 16, Rohini",₹55 Lacs,"₹31,522/Month",630 sqft
3,3 BHK Flat For Sale In Rohini Sector 21,"Standalone building, Pocket 7,Near New Millenn...",₹32 Lacs,"₹18,340/Month",516 sqft
4,2 BHK Flat For Sale In Westend Apartment Roh...,Rohini,₹95 Lacs,"₹54,448/Month","1,200 sqft"
5,1 BHK Flat For Sale In Dda Lig Flats In Rohini,"Utsav Marg, near NIDM",₹30 Lacs,"₹17,194/Month",500 sqft
6,2 BHK In Independent House For Sale In Rohin...,"Location, H no. B-19/295, kailash vihar pans...",₹21 Lacs,"₹12,036/Month",540 sqft
7,2 BHK In Independent House For Sale In Rohini,sector 24,₹80 Lacs,"₹45,851/Month",784 sqft
8,1 RK Flat For Sale In Rohini,"D/17,sector 3",₹21 Lacs,"₹12,036/Month",280 sqft
9,"2 BHK Flat For Sale In Sector 2 Rohini ,dda ...",pocket 5 sector 2 rohini,₹42 Lacs,"₹24,072/Month",500 sqft

# Write a python program to scrape fresher job listings from ‘https://internshala.com/’. It should include job title, company name, CTC, and apply date.

In [124]:
page = requests.get('https://internshala.com/fresher-jobs')
page

In [125]:
target_job = BeautifulSoup(page.content)

In [126]:
title_job = target_job.find_all(class_= 'heading_4_5 profile')

In [127]:
job_title = []
for i in title_job:
    job_title.append(i.text.replace('\n'," "))

In [128]:
comp_name = target_job.find_all(class_='heading_6 company_name')

company_name = []
for i in comp_name:
    company_name.append(i.text.strip())

In [129]:
ctc = target_job.find_all('div',class_='item_body')

In [130]:
ctc_new = []
for i in ctc:
    ctc_new.append(i.text.split())

In [131]:
final_apply_date = ctc_new[2:120:3]

In [132]:
final_ctc = ctc_new[1:120:3]

In [133]:
job_details = pd.DataFrame({})
job_details['company_name'] = company_name
job_details['Job Title'] = job_title
job_details['CTC'] = final_ctc
job_details['Apply Date'] = final_apply_date

job_details

,company_name,Job Title,CTC,Apply Date
0,NSE Academy,Business Development Executive,"[3, LPA]","[31, Oct', 21]"
1,CEAT Limited,Management Trainee - Sales,"[5, LPA]","[29, Oct', 21]"
2,Graygraph Technologies LLC,Business Development Manager (Digital Marketi...,"[4.2, -, 4.8, LPA]","[1, Nov', 21]"
3,Samvedna Senior Care Private Limited,Corporate Sales Executive,"[3.25, -, 4, LPA]","[1, Nov', 21]"
4,High School Moms,Junior Content Writer,"[3, -, 3.2, LPA]","[1, Nov', 21]"
5,NNIIT,Business Development Associate/Manager,"[3.02, -, 8, LPA]","[1, Nov', 21]"
6,Revidd,Software Engineer,"[3, -, 5, LPA]","[1, Nov', 21]"
7,HelloSivi,Associate Data Scientist,"[4.8, -, 6, LPA]","[1, Nov', 21]"
8,HelloSivi,JavaScript Developer,"[4.8, -, 6, LPA]","[1, Nov', 21]"
9,Reading Right,Associate Video Editor,"[3, -, 5, LPA]","[1, Nov', 21]"
10,Markytics,Data Science Python Developer,"[3, -, 6, LPA]","[1, Nov', 21]"
11,Newgen Payments,DevOps Engineer,"[3.5, -, 4.5, LPA]","[31, Oct', 21]"
12,The Eat Better Company,Customer Service Specialist,"[3, -, 3.5, LPA]","[31, Oct', 21]"
13,Uniqubic Solutions Private Limited,Junior Software Developer,"[3, -, 3.6, LPA]","[31, Oct', 21]"
14,Vibhava Marketing Corporation,Sales Officer,"[3, -, 3.01, LPA]","[31, Oct', 21]"
15,Binary Stream,Software Developer,"[3, -, 3.5, LPA]","[31, Oct', 21]"
16,Padhhigh,Assistant Growth Manager - Inside Sales,"[5, -, 7, LPA]","[31, Oct', 21]"
17,Phoenix (Feenix) Medical Education & Research ...,Office Executive (Marketing),"[3.5, LPA]","[31, Oct', 21]"
18,Startxlabs Technologies Private Limited,Android Application Developer,"[3, -, 3.1, LPA]","[31, Oct', 21]"
19,Bungeetech,Junior Software Developer,"[5.5, -, 8.5, LPA]","[31, Oct', 21]"
20,TogetherV,Business Development Associate,"[3, -, 4, LPA]","[31, Oct', 21]"
21,Intesome,International Sales Executive,"[3, -, 4, LPA]","[31, Oct', 21]"
22,Intesome,B2B Sales & Marketing Executive,"[3, -, 4, LPA]","[31, Oct', 21]"
23,Intesome,Online Sales & Marketing Executive,"[3, -, 4, LPA]","[31, Oct', 21]"
24,Intesome,International Business Development Executive,"[3, -, 4, LPA]","[31, Oct', 21]"
25,Tatva Health,Content Writer,"[3, -, 3.5, LPA]","[31, Oct', 21]"
26,Wono Inc,Credit Coordinator,"[5, -, 5.7, LPA]","[31, Oct', 21]"
27,Wono Inc,JUNIOR QUALITY ANALYST,"[5.1, -, 6, LPA]","[31, Oct', 21]"
28,Wono Inc,Junior Website Developer,"[5.1, -, 6.1, LPA]","[31, Oct', 21]"
29,Tekolutions,Ruby On Rails Developer,"[3, -, 3.5, LPA]","[31, Oct', 21]"
30,Daphnis Labs Technologies Private Limited,Business Development Executive,"[3.2, -, 7, LPA]","[31, Oct', 21]"
31,Nowi Idea Private Limited,Excel Developer,"[3, -, 4.5, LPA]","[31, Oct', 21]"
32,Shopocus,Senior WordPress Developer,"[3, -, 4, LPA]","[31, Oct', 21]"
33,FinDestination,Credit Analyst,"[3, LPA]","[31, Oct', 21]"
34,KYC2020 LLC,Junior Software Engineer - Business Analysis ...,"[3, -, 4, LPA]","[31, Oct', 21]"
35,KYC2020 LLC,Junior Software Engineer - Java,"[3, -, 4.5, LPA]","[31, Oct', 21]"
36,APAC Financial Services Private Limited,Assistant Manager - Risk,"[7, -, 9, LPA]","[31, Oct', 21]"
37,Webtechage Private Limited,Corporate Sales Executive,"[3, -, 5, LPA]","[31, Oct', 21]"
38,Bilateral Solutions Private Limited,Customer Acquisition Executive,"[4, -, 5, LPA]","[31, Oct', 21]"
39,Solidus Capital LLP,Digital Marketing Specialist,"[3, -, 3.2, LPA]","[30, Oct', 21]"

# Write a python program to scrape details of all the mobile phones under Rs. 20,000 listed on Amazon.in. The scraped data should include Product Name, Price, Image URL and Average Rating.

In [134]:
page  = requests.get('https://www.amazon.in/s?k=mobiles+under+30000&rh=p_36%3A-3000000&qid=1633157245&rnid=1318502031&ref=sr_nr_p_36_5')
page

# Write a python program to scrape cricket rankings from ‘www.icc-cricket.com’. You have to scrape:
    
i) Top 10 ODI teams in women’s cricket along with the records for matches, points and rating.

ii) Top 10 women’s ODI players along with the records of their team and rating.

iii) Top 10 women’s ODI all-rounder along with the records of their team and rating.

In [135]:
page = requests.get('https://www.icc-cricket.com/rankings/womens/team-rankings/odi')
page

In [136]:
new_page = BeautifulSoup(page.content)

In [137]:
titles = new_page.find_all('span',class_='u-hide-phablet')

In [138]:
teams = []
for i in titles:
    teams.append(i.text)

In [139]:
del teams[10:15]

In [140]:
teams

['Australia',
 'England',
 'South Africa',
 'India',
 'New Zealand',
 'West Indies',
 'Pakistan',
 'Bangladesh',
 'Sri Lanka',
 'Ireland']

In [141]:
title2 =  new_page.find('td',class_='rankings-block__banner--matches').text
title2

'21'

In [142]:
title3 = new_page.find(class_='rankings-block__banner--points').text
title3

'3,379'

In [143]:
title4 = new_page.find(class_="rankings-block__banner--rating u-text-right").text.replace("\n","")

In [144]:
title4

'                            161                            '

In [145]:
title5 = new_page.find_all(class_="table-body__cell u-center-text")

In [146]:
matches = []
for i in title5:
    matches.append(i.text)

matches

['25',
 '2,983',
 '29',
 '3,390',
 '26',
 '2,934',
 '26',
 '2,392',
 '22',
 '1,872',
 '20',
 '1,496',
 '5',
 '306',
 '11',
 '519',
 '2',
 '25']

In [147]:
matches_played = matches[0:18:2]
matches_played

['25', '29', '26', '26', '22', '20', '5', '11', '2']

In [148]:
points = matches[1:18:2]
points

['2,983', '3,390', '2,934', '2,392', '1,872', '1,496', '306', '519', '25']

In [149]:
print(len(matches_played),len(points),len(teams))

9 9 10

In [150]:
rate = new_page.find_all(class_="table-body__cell u-text-right rating")

In [151]:
rating = []
for i in rate:
    rating.append(i.text)

In [152]:
rating

['119', '117', '113', '92', '85', '75', '61', '47', '13']

In [153]:
matches_played.insert(0,title2)

In [154]:
points.insert(0,title3)

In [155]:
rating.insert(0,title4)

In [156]:
print(len(matches_played),len(points),len(teams),len(rating))

10 10 10 10

In [157]:
womens_odi_rating = pd.DataFrame({})
womens_odi_rating['Team Name'] = teams
womens_odi_rating['Matches Played'] = matches_played
womens_odi_rating['Total Points'] = points
womens_odi_rating['Rating'] = rating

womens_odi_rating

,Team Name,Matches Played,Total Points,Rating
0,Australia,21,"3,379",161 ...
1,England,25,"2,983",119
2,South Africa,29,"3,390",117
3,India,26,"2,934",113
4,New Zealand,26,"2,392",92
5,West Indies,22,"1,872",85
6,Pakistan,20,"1,496",75
7,Bangladesh,5,306,61
8,Sri Lanka,11,519,47
9,Ireland,2,25,13

ii) Top 10 women’s ODI players along with the records of their team and rating.

In [158]:
page = requests.get('https://www.icc-cricket.com/rankings/womens/player-rankings/odi/batting')
page

In [159]:
target = BeautifulSoup(page.content)

In [160]:
title1_name = target.find(class_="rankings-block__banner--name-large").text
title1_name

'Lizelle Lee'

In [161]:
title2_count = target.find(class_="rankings-block__banner--nationality").text.strip()
title2_count

'SA'

In [162]:
title3_rank = target.find(class_="rankings-block__banner--rating").text
title3_rank

'761'

In [163]:
pos = target.find('td',class_ = "rankings-block__position").text
pos

'1'

In [164]:
position = target.find_all('td',class_ = "table-body__cell table-body__cell--position u-text-right")

In [165]:
position_new = []
for i in position:
    position_new.append(i.text.strip().replace('\n'," "))

In [166]:
player_position = position_new[0:10]

In [167]:
name = target.find_all(class_="table-body__cell rankings-table__name name")

In [168]:
all_names = []
for i in name:
    all_names.append(i.text.strip())

In [169]:
player_names = all_names[0:10]
print(player_names)
print(len(player_names))

['Alyssa Healy', 'Mithali Raj', 'Tammy Beaumont', 'Amy Satterthwaite', 'Smriti Mandhana', 'Meg Lanning', 'Beth Mooney', 'Heather Knight', 'Laura Wolvaardt', 'Rachael Haynes']
10

In [170]:
count = target.find_all(class_ = 'table-body__logo-text')

In [171]:
countary = []
for i in count:
    countary.append(i.text)

In [172]:
countary_name = countary[0:10]
print(len(countary_name))
print(countary_name)

10
['AUS', 'IND', 'ENG', 'NZ', 'IND', 'AUS', 'AUS', 'ENG', 'SA', 'AUS']

In [173]:
rate = target.find_all(class_='table-body__cell rating')
rating = []
for i in rate:
    rating.append(i.text)

In [174]:
player_position.insert(0,pos)
player_names.insert(0,title1_name)
countary_name.insert(0,title2_count)
ratings.insert(0,title3_rank)

In [175]:
print(len(player_position),len(player_names),len(countary_name),len(ratings))

11 11 11 11

In [176]:
women_team = pd.DataFrame({})

women_team['Position'] = player_position
women_team['Name of the player'] = player_names
women_team['Countary Name'] = countary_name
women_team['Ratings of the player'] = ratings

women_team

,Position,Name of the player,Countary Name,Ratings of the player
0,1,Lizelle Lee,SA,761
1,2,Alyssa Healy,AUS,737
2,3,Mithali Raj,IND,709
3,4 This player has moved up in the ...,Tammy Beaumont,ENG,708
4,5 This player has moved down in th...,Amy Satterthwaite,NZ,700
5,6 This player has moved down in th...,Smriti Mandhana,IND,692
6,7 This player has moved down in th...,Meg Lanning,AUS,691
7,8 This player has moved up in the ...,Beth Mooney,AUS,679
8,9 This player has moved down in th...,Heather Knight,ENG,652
9,10 This player has moved up in the...,Laura Wolvaardt,SA,650
10,11 This player has moved down in t...,Rachael Haynes,AUS,646

3. Top 10 women’s ODI all-rounder along with the records of their team and rating.

In [177]:
page = requests.get('https://www.icc-cricket.com/rankings/womens/player-rankings/odi/all-rounder')
page

In [178]:
allrounder = BeautifulSoup(page.content)

In [179]:
pos1 = allrounder.find(class_= 'rankings-block__position').text
pos1

'1'

In [180]:
player1 = allrounder.find(class_= 'rankings-block__banner--name-large').text
player1

'Marizanne Kapp'

In [181]:
team1 = allrounder.find(class_='rankings-block__banner--nationality').text.replace('\n','')
team1

'SA                    '

In [182]:
rating1 = allrounder.find(class_='rankings-block__banner--rating').text
rating1

'384'

In [183]:
pos2 = allrounder.find_all('td', class_= 'table-body__cell table-body__cell--position u-text-right')
pos3 = []
for i in pos2:
    pos3.append(i.text.strip().replace('\n',""))

In [184]:
player2 = allrounder.find_all(class_='table-body__cell rankings-table__name name')

In [185]:
player3 = []
for i in player2:
    player3.append(i.text.strip())

In [186]:
team2 = allrounder.find_all(class_='table-body__logo-text')
team3=[]
for i in team2:
    team3.append(i.text.strip())

In [187]:
rate2 = allrounder.find_all(class_='table-body__cell rating')
rate3 = []
for i in rate2:
    rate3.append(i.text)

In [188]:
pos3.insert(0,pos1)
player3.insert(0,player1)
team3.insert(0,team1)
rate3.insert(0,rating1)

In [189]:
print(len(pos3),len(player3),len(team3),len(rate3))

20 20 20 20

In [190]:
allrounders_rating = pd.DataFrame({})

allrounders_rating['Position'] = pos3
allrounders_rating['Player'] = player3
allrounders_rating['Rating'] = rate3
allrounders_rating['Countary'] = team3

allrounders_rating

,Position,Player,Rating,Countary
0,1,Marizanne Kapp,384,SA
1,2 This player has moved up in the ranki...,Natalie Sciver,372,ENG
2,3 This player has moved down in the ran...,Ellyse Perry,365,AUS
3,4,Stafanie Taylor,322,WI
4,5,Deepti Sharma,299,IND
5,6 This player has moved up in the ranki...,Ashleigh Gardner,275,AUS
6,7 This player has moved up in the ranki...,Dane van Niekerk,274,SA
7,8 This player has moved down in the ran...,Jess Jonassen,272,AUS
8,This player has moved down in the rankings sin...,Katherine Brunt,272,ENG
9,10 This player has moved up in the rank...,Jhulan Goswami,251,IND
10,11 This player has moved down in the ra...,Sophie Devine,248,NZ
11,12,Hayley Matthews,220,WI
12,13 This player has moved up in the rank...,Heather Knight,195,ENG
13,14 This player has moved down in the ra...,Amelia Kerr,193,NZ
14,15,Nida Dar,176,PAK
15,16 This player has moved down in the ra...,Shikha Pandey,173,IND
16,17 This player has moved down in the ra...,Rumana Ahmed,172,BAN
17,18,Chamari Athapaththu,151,SL
18,19 This player has moved up in the rank...,Deandra Dottin,142,WI
19,20 This player has moved up in the rank...,Kate Cross,141,ENG

# Write a python program to extract information about the local weather from the National Weather Service website of USA, https://www.weather.gov/ for the city, San Francisco. You need to extract data about 7 day extended forecast display for the city. The data should include period, short description, temperature and description.

In [191]:
page = requests.get('https://forecast.weather.gov/MapClick.php?textField1=37.77&textField2=-122.42#.YVYn8JpBxPY')
page

In [192]:
weather = BeautifulSoup(page.content)

In [193]:
t1 = weather.find_all(class_='period-name')
print(t1)
print(len(t1))

[<p class="period-name">Overnight<br/><br/></p>, <p class="period-name">Sunday<br/><br/></p>, <p class="period-name">Sunday<br/>Night</p>, <p class="period-name">Monday<br/><br/></p>, <p class="period-name">Monday<br/>Night</p>, <p class="period-name">Tuesday<br/><br/></p>, <p class="period-name">Tuesday<br/>Night</p>, <p class="period-name">Wednesday<br/><br/></p>, <p class="period-name">Wednesday<br/>Night</p>]
9

In [194]:
period = []
for i in t1:
    period.append(i.text)

print(period)
print(len(period))

['Overnight', 'Sunday', 'SundayNight', 'Monday', 'MondayNight', 'Tuesday', 'TuesdayNight', 'Wednesday', 'WednesdayNight']
9

In [195]:
t2 = weather.find_all(class_="short-desc")
t2

[<p class="short-desc">Mostly Clear</p>,
 <p class="short-desc">Sunny</p>,
 <p class="short-desc">Partly Cloudy</p>,
 <p class="short-desc">Mostly Sunny</p>,
 <p class="short-desc">Partly Cloudy</p>,
 <p class="short-desc">Partly Sunny</p>,
 <p class="short-desc">Mostly Cloudy</p>,
 <p class="short-desc">Mostly Cloudy</p>,
 <p class="short-desc">Mostly Cloudy</p>]

In [196]:
short_desc = []
for i in t2:
    short_desc.append(i.text)
    
print(short_desc)
print(len(short_desc))

['Mostly Clear', 'Sunny', 'Partly Cloudy', 'Mostly Sunny', 'Partly Cloudy', 'Partly Sunny', 'Mostly Cloudy', 'Mostly Cloudy', 'Mostly Cloudy']
9

In [197]:
t4 = weather.find_all(class_='forecast-tombstone')
temp = []
for i in t4:
    temp.append(i.text.strip().replace('\n',' '))

In [198]:
temp

['Overnight Mostly ClearLow: 59 °F',
 'Sunday SunnyHigh: 79 °F',
 'SundayNight Partly CloudyLow: 57 °F',
 'Monday Mostly SunnyHigh: 75 °F',
 'MondayNight Partly CloudyLow: 56 °F',
 'Tuesday Partly SunnyHigh: 66 °F',
 'TuesdayNight Mostly CloudyLow: 56 °F',
 'Wednesday Mostly CloudyHigh: 65 °F',
 'WednesdayNight Mostly CloudyLow: 55 °F']

In [199]:
t5 = weather.find_all(class_='col-sm-2 forecast-label')

In [200]:
t7 = []
for i in t5:
    t7.append(i.text)

In [201]:
t6 = weather.find_all(class_='col-sm-10 forecast-text')
t8 = []
for i in t6:
    t8.append(i.text)

In [202]:
weather_forecast = pd.DataFrame({})
weather_forecast["Period"] = period
weather_forecast['Short Description'] = short_desc
weather_forecast["Temprature"] = temp

weather_forecast

           Period Short Description                              Temprature
0       Overnight      Mostly Clear        Overnight Mostly ClearLow: 59 °F
1          Sunday             Sunny                 Sunday SunnyHigh: 79 °F
2     SundayNight     Partly Cloudy     SundayNight Partly CloudyLow: 57 °F
3          Monday      Mostly Sunny          Monday Mostly SunnyHigh: 75 °F
4     MondayNight     Partly Cloudy     MondayNight Partly CloudyLow: 56 °F
5         Tuesday      Partly Sunny         Tuesday Partly SunnyHigh: 66 °F
6    TuesdayNight     Mostly Cloudy    TuesdayNight Mostly CloudyLow: 56 °F
7       Wednesday     Mostly Cloudy      Wednesday Mostly CloudyHigh: 65 °F
8  WednesdayNight     Mostly Cloudy  WednesdayNight Mostly CloudyLow: 55 °F